# Assignment 6 - Data Cleaning

It happens all the time: someone gives you data containing malformed strings, Python, lists and missing data. How do you tidy it up so you can get on with the analysis? Take this monstrosity as the DataFrame to use in the following puzzles: 

df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 'Budapest_PaRis', 'Brussels_londOn'],<br> 
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], <br>
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],<br> 
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', '12. Air France', '"Swiss Air"']})

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', ' (12)', '(British Airways. )', '12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []                 (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

<b>1.Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).<b>

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
From_To         5 non-null object
FlightNumber    3 non-null float64
RecentDelays    5 non-null object
Airline         5 non-null object
dtypes: float64(1), object(3)
memory usage: 288.0+ bytes

In [5]:
for i in range(0,len(df['FlightNumber'])):
    if  pd.isnull(df.iloc[i,1]):
        df.iloc[i,1] =  df.iloc[i-1,1]+ 10

In [6]:
df['FlightNumber']

0    10045.0
1    10055.0
2    10065.0
3    10075.0
4    10085.0
Name: FlightNumber, dtype: float64

In [7]:
df['FlightNumber']=df['FlightNumber'].astype('int64')

In [8]:
df['FlightNumber']

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int64

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
From_To         5 non-null object
FlightNumber    5 non-null int64
RecentDelays    5 non-null object
Airline         5 non-null object
dtypes: int64(1), object(3)
memory usage: 288.0+ bytes

<b>2.The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.<b>

In [10]:
tempFromTo=df['From_To'].str.split('_',expand=True)

In [11]:
tempFromTo

          0          1
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [12]:
tempFromTo.columns=['From','To']

In [13]:
tempFromTo

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [14]:
tempFromTo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
From    5 non-null object
To      5 non-null object
dtypes: object(2)
memory usage: 208.0+ bytes

<b>3.Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)<b>

In [15]:
tempFromTo=tempFromTo.apply(lambda x:x.str.capitalize())

In [16]:
tempFromTo

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

<b>4.Delete the From_To column from df and attach the temporary DataFrame from the previous questions.<b>

In [17]:
del df['From_To']

In [18]:
df

   FlightNumber  RecentDelays              Airline
0         10045      [23, 47]               KLM(!)
1         10055            []                 (12)
2         10065  [24, 43, 87]  (British Airways. )
3         10075          [13]       12. Air France
4         10085      [67, 32]          "Swiss Air"

In [19]:
df=pd.concat([df,tempFromTo],axis=1)

In [20]:
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []                 (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

<b>5.In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.<b>

In [21]:
df['RecentDelays']

0        [23, 47]
1              []
2    [24, 43, 87]
3            [13]
4        [67, 32]
Name: RecentDelays, dtype: object

In [22]:
df['RecentDelays'].dtype

dtype('O')

In [23]:
delays=df['RecentDelays'].astype(str).str.strip('[]')

In [24]:
delays

0        23, 47
1
2    24, 43, 87
3            13
4        67, 32
Name: RecentDelays, dtype: object

In [25]:
delays=delays.str.split(',',expand=True)
delays

    0     1     2
0  23    47  None
1      None  None
2  24    43    87
3  13  None  None
4  67    32  None

In [26]:
delays.replace(to_replace=[None,''],value=np.nan,inplace=True)

In [27]:
delays

     0    1    2
0   23   47  NaN
1  NaN  NaN  NaN
2   24   43   87
3   13  NaN  NaN
4   67   32  NaN

In [29]:
elements=df['RecentDelays'].apply(lambda x:len(x))

In [30]:
max_columns=max(elements)  #finding the maximum elements in the lists
max_columns

3

In [31]:
columns_list=["delay_"+str(i) for i in range(1,max_columns+1)]  #generating the column names list
columns_list

['delay_1', 'delay_2', 'delay_3']

In [32]:
delays.columns=columns_list  #renaming the column names in delays dataframe

In [33]:
delays

  delay_1 delay_2 delay_3
0      23      47     NaN
1     NaN     NaN     NaN
2      24      43      87
3      13     NaN     NaN
4      67      32     NaN

In [34]:
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []                 (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [35]:
del df['RecentDelays']    
df

   FlightNumber              Airline      From         To
0         10045               KLM(!)    London      Paris
1         10055                 (12)    Madrid      Milan
2         10065  (British Airways. )    London  Stockholm
3         10075       12. Air France  Budapest      Paris
4         10085          "Swiss Air"  Brussels     London

In [36]:
df=pd.concat([df,delays],axis=1)  
df

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045,KLM(!),London,Paris,23,47,NaN
1,10055,(12),Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways. ),London,Stockholm,24,43,87
3,10075,12. Air France,Budapest,Paris,13,NaN,NaN
4,10085,"""Swiss Air""",Brussels,London,67,32,NaN